In [1]:
# Dependencies and Setup
import pandas as pd
from pathlib import Path
from functools import reduce

In [2]:
school_data_csv = Path("../Resources/schools_complete.csv")
student_data_csv = Path("../Resources/students_complete.csv")

In [3]:
school_data_df = pd.read_csv(school_data_csv)
student_data_df = pd.read_csv(student_data_csv)

In [4]:
combo_df = pd.merge(student_data_df, school_data_df, how="left", on=["school_name", "school_name"])
combo_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [5]:
school_array = combo_df["school_name"].unique()
school_count = len(school_array)
school_count

15

In [6]:
# Calculate the total number of students (no modifier b/c student ID starts at 0)
total_stud_ids = combo_df["Student ID"].shape[0]
total_stud_ids

39170

In [9]:
# Calculate the total budget

total_budget = school_data_df["budget"].sum()
print(f"${total_budget}")

$24649428

In [11]:
# Calculate the average (mean) math score

avg_math_score= student_data_df["math_score"].mean()
print(f"%{avg_math_score}")

%78.98537145774827

In [12]:
# Calculate the average (mean) reading score
avg_reading_score= student_data_df["reading_score"].mean()
print(f"%{avg_reading_score}")

%81.87784018381414

In [13]:
# Use the following to calculate the percentage of students who passed math (math scores greather than or equal to 70)
passing_math_count = combo_df[(combo_df["math_score"] >= 70)].count()["student_name"]
passing_math_percentage = passing_math_count / float(total_stud_ids) * 100
passing_math_percentage

74.9808526933878

In [14]:
# Calculate the percentage of students who passed reading (hint: look at how the math percentage was calculated)
passing_reading_count = combo_df[(combo_df["reading_score"] >= 70)].count()["student_name"]
passing_reading_percentage = passing_reading_count / float(total_stud_ids) * 100
passing_reading_percentage

85.80546336482001

In [15]:
# Use the following to calculate the percentage of students that passed math and reading
passing_math_reading_count = combo_df[
    (combo_df["math_score"] >= 70) & (combo_df["reading_score"] >= 70)
].count()["student_name"]
overall_passing_rate = passing_math_reading_count /  float(total_stud_ids) * 100
overall_passing_rate

65.17232575950983

In [17]:
district_summary = pd.DataFrame({'Total Schools': [school_count], 'Total Students':[total_stud_ids], 'Total Budget':[total_budget], 'Average Math Score':[avg_math_score], 'Average Reading Score':[avg_reading_score], '% Passing Math':[passing_math_percentage], '% Passing Reading': [passing_reading_percentage], '% Overall Passing':[overall_passing_rate]})

# Formatting
district_summary["Total Students"] = district_summary["Total Students"].map("{:,}".format)
district_summary["Total Budget"] = district_summary["Total Budget"].map("${:,.2f}".format)

# Display the DataFrame
district_summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",78.985371,81.87784,74.980853,85.805463,65.172326

SCHOOL SUMMARY

In [18]:
# Use the code provided to select the type per school from school_data
school_types = school_data_df.set_index(["school_name"])["type"]
school_types

school_name
Huang High School        District
Figueroa High School     District
Shelton High School       Charter
Hernandez High School    District
Griffin High School       Charter
Wilson High School        Charter
Cabrera High School       Charter
Bailey High School       District
Holden High School        Charter
Pena High School          Charter
Wright High School        Charter
Rodriguez High School    District
Johnson High School      District
Ford High School         District
Thomas High School        Charter
Name: type, dtype: object

In [19]:
# Calculate the total student count per school from school_data
total_student_count  = combo_df["school_name"].value_counts()
total_student_count

school_name
Bailey High School       4976
Johnson High School      4761
Hernandez High School    4635
Rodriguez High School    3999
Figueroa High School     2949
Huang High School        2917
Ford High School         2739
Wilson High School       2283
Cabrera High School      1858
Wright High School       1800
Shelton High School      1761
Thomas High School       1635
Griffin High School      1468
Pena High School          962
Holden High School        427
Name: count, dtype: int64

In [37]:
# Calculate the total school budget and per capita spending per school from school_data
per_school_total_budget_df = school_data_df.groupby(['school_name'])['budget'].sum()

per_school_total_budget_df

school_name
Bailey High School       3124928
Cabrera High School      1081356
Figueroa High School     1884411
Ford High School         1763916
Griffin High School       917500
Hernandez High School    3022020
Holden High School        248087
Huang High School        1910635
Johnson High School      3094650
Pena High School          585858
Rodriguez High School    2547363
Shelton High School      1056600
Thomas High School       1043130
Wilson High School       1319574
Wright High School       1049400
Name: budget, dtype: int64

In [38]:
percap_df = pd.merge(per_school_total_budget_df, total_student_count, how="left", on=["school_name"])
percap_df.head()

                       budget  count
school_name
Bailey High School    3124928   4976
Cabrera High School   1081356   1858
Figueroa High School  1884411   2949
Ford High School      1763916   2739
Griffin High School    917500   1468

In [39]:
percap_df['Per Capita'] = percap_df['budget'] / percap_df['count']
per_student_budget = percap_df.drop(columns=['budget', 'count'])

per_student_budget

                       Per Capita
school_name
Bailey High School          628.0
Cabrera High School         582.0
Figueroa High School        639.0
Ford High School            644.0
Griffin High School         625.0
Hernandez High School       652.0
Holden High School          581.0
Huang High School           655.0
Johnson High School         650.0
Pena High School            609.0
Rodriguez High School       637.0
Shelton High School         600.0
Thomas High School          638.0
Wilson High School          578.0
Wright High School          583.0

In [43]:
avg_m_school = combo_df.groupby(['school_name'])['math_score'].mean()
avg_m_school

school_name
Bailey High School       77.048432
Cabrera High School      83.061895
Figueroa High School     76.711767
Ford High School         77.102592
Griffin High School      83.351499
Hernandez High School    77.289752
Holden High School       83.803279
Huang High School        76.629414
Johnson High School      77.072464
Pena High School         83.839917
Rodriguez High School    76.842711
Shelton High School      83.359455
Thomas High School       83.418349
Wilson High School       83.274201
Wright High School       83.682222
Name: math_score, dtype: float64

In [68]:
avg_r_school = combo_df.groupby(['school_name'])['reading_score'].mean()
avg_r_school

school_name
Bailey High School       81.033963
Cabrera High School      83.975780
Figueroa High School     81.158020
Ford High School         80.746258
Griffin High School      83.816757
Hernandez High School    80.934412
Holden High School       83.814988
Huang High School        81.182722
Johnson High School      80.966394
Pena High School         84.044699
Rodriguez High School    80.744686
Shelton High School      83.725724
Thomas High School       83.848930
Wilson High School       83.989488
Wright High School       83.955000
Name: reading_score, dtype: float64

In [69]:
mpassing_count = combo_df.loc[combo_df['math_score'] >=70, ['school_name', 'math_score']]
mpassing_count

              school_name  math_score
0       Huang High School          79
4       Huang High School          84
5       Huang High School          94
6       Huang High School          80
8       Huang High School          87
...                   ...         ...
39165  Thomas High School          90
39166  Thomas High School          70
39167  Thomas High School          84
39168  Thomas High School          90
39169  Thomas High School          75

[29370 rows x 2 columns]

In [79]:
rpassing_count = combo_df.loc[combo_df['reading_score'] >=70, ['school_name', 'reading_score']]
rpassing_count

              school_name  reading_score
1       Huang High School             94
2       Huang High School             90
4       Huang High School             97
5       Huang High School             94
6       Huang High School             82
...                   ...            ...
39165  Thomas High School             99
39166  Thomas High School             95
39167  Thomas High School             73
39168  Thomas High School             99
39169  Thomas High School             95

[33610 rows x 2 columns]

In [75]:
munique = mpassing_count.groupby(['school_name'])['school_name'].value_counts()
munique

school_name
Bailey High School       3318
Cabrera High School      1749
Figueroa High School     1946
Ford High School         1871
Griffin High School      1371
Hernandez High School    3094
Holden High School        395
Huang High School        1916
Johnson High School      3145
Pena High School          910
Rodriguez High School    2654
Shelton High School      1653
Thomas High School       1525
Wilson High School       2143
Wright High School       1680
Name: count, dtype: int64

In [80]:
runique = rpassing_count.groupby(['school_name'])['school_name'].value_counts()
runique

school_name
Bailey High School       4077
Cabrera High School      1803
Figueroa High School     2381
Ford High School         2172
Griffin High School      1426
Hernandez High School    3748
Holden High School        411
Huang High School        2372
Johnson High School      3867
Pena High School          923
Rodriguez High School    3208
Shelton High School      1688
Thomas High School       1591
Wilson High School       2204
Wright High School       1739
Name: count, dtype: int64

In [82]:
munique_comb = pd.merge(munique, total_student_count, how="left", on=["school_name"])
munique_comb['Percent Math Passing'] = munique_comb['count_x'] / munique_comb['count_y'] *100
munique_comb.head()

                      count_x  count_y  Percent Math Passing
school_name
Bailey High School       3318     4976             66.680064
Cabrera High School      1749     1858             94.133477
Figueroa High School     1946     2949             65.988471
Ford High School         1871     2739             68.309602
Griffin High School      1371     1468             93.392371

In [83]:
runique_comb = pd.merge(runique, total_student_count, how="left", on=["school_name"])
runique_comb['Percent Reading Passing'] = runique_comb['count_x'] / munique_comb['count_y'] *100
runique_comb.head()

                      count_x  count_y  Percent Reading Passing
school_name
Bailey High School       4077     4976                81.933280
Cabrera High School      1803     1858                97.039828
Figueroa High School     2381     2949                80.739234
Ford High School         2172     2739                79.299014
Griffin High School      1426     1468                97.138965

In [85]:
mpassing_test = combo_df[(combo_df['math_score'] >=70) & (combo_df['reading_score'] >=70)] 
mrpass_combo = mpassing_test[['school_name', 'math_score', 'reading_score']]
mrpass_combo.head()

         school_name  math_score  reading_score
4  Huang High School          84             97
5  Huang High School          94             94
6  Huang High School          80             82
8  Huang High School          87             95
9  Huang High School          84             96

In [27]:
mpassing_df = combo_df.loc[combo_df['math_score'] >=70, ['school_name', 'math_score', 'reading_score']]
mpassing_df.head()

         school_name  math_score  reading_score
0  Huang High School          79             66
4  Huang High School          84             97
5  Huang High School          94             94
6  Huang High School          80             82
8  Huang High School          87             95

In [36]:
mrpassing_df = mpassing_df.loc[mpassing_df['reading_score'] >=70, ['school_name', 'reading_score']]
mrpassing_students_df  = mrpassing_df["school_name"].value_counts()

mrpassing_perc = pd.merge(mrpassing_students_df, total_student_count, on="school_name")
mrpassing_perc['%MR Passing'] = mrpassing_perc['count_x'] / mrpassing_perc['count_y']
mrpassing_perc.rename(columns={'count_x': 'Math & Read Passing', 'count_y': 'Student Count'}, inplace=True)

mrpassing_perc

                       Math & Read Passing  Student Count  %MR Passing
school_name
Bailey High School                    2719           4976     0.546423
Johnson High School                   2549           4761     0.535392
Hernandez High School                 2481           4635     0.535275
Rodriguez High School                 2119           3999     0.529882
Wilson High School                    2068           2283     0.905826
Cabrera High School                   1697           1858     0.913348
Wright High School                    1626           1800     0.903333
Shelton High School                   1583           1761     0.898921
Figueroa High School                  1569           2949     0.532045
Huang High School                     1561           2917     0.535139
Ford High School                      1487           2739     0.542899
Thomas High School                    1487           1635     0.909480
Griffin High School                   1330           1468     0.905995
Pena High School                       871            962     0.905405
Holden High School                     381            427     0.892272

In [136]:
best_performing = mrpassing_perc.sort_values(["%MR Passing"], ascending= False)
top_schools = best_performing.drop(columns=['count_x', 'count_y'])
top_schools.head(5)

                     %MR Passing
school_name
Cabrera High School     0.913348
Thomas High School      0.909480
Griffin High School     0.905995
Wilson High School      0.905826
Pena High School        0.905405

In [135]:
worst_performing = mrpassing_perc.sort_values(["%MR Passing"])
bottom_schools = worst_performing.drop(columns=['count_x', 'count_y'])
bottom_schools.head(5)

                       %MR Passing
school_name
Rodriguez High School     0.529882
Figueroa High School      0.532045
Huang High School         0.535139
Hernandez High School     0.535275
Johnson High School       0.535392

In [112]:
# Create a DataFrame called `per_school_summary` with columns for the calculations above.
per_school_summary = pd.merge(school_types, total_student_count, per_school_total_budget_df, percap_df, mpassing_df, mpassing_df, on="school_name")

# Formatting
per_school_summary["Total School Budget"] = per_school_summary["Total School Budget"].map("${:,.2f}".format)
per_school_summary["Per Student Budget"] = per_school_summary["Per Student Budget"].map("${:,.2f}".format)

# Display the DataFrame
per_school_summary

TypeError: merge() got multiple values for argument 'on'

In [79]:
ninth_graders = combo_df[(combo_df["grade"] == "9th")]
tenth_graders = combo_df[(combo_df["grade"] == "10th")]
eleventh_graders = combo_df[(combo_df["grade"] == "11th")]
twelfth_graders = combo_df[(combo_df["grade"] == "12th")]

# Group by `school_name` and take the mean of the `math_score` column for each.
ninth_grade_math_scores = ninth_graders.groupby(['school_name']).mean(['math_score'])
tenth_grader_math_scores = tenth_graders.groupby(['school_name']).mean(['math_score'])
eleventh_grader_math_scores = eleventh_graders.groupby(['school_name']).mean('math_score')
twelfth_grader_math_scores = twelfth_graders.groupby(['school_name']).mean(['math_score'])

math_scores_by_grade = pd.DataFrame({'9th': [ninth_grade_math_scores],
                                         '10th': [tenth_graders],
                                          '11th': [eleventh_grader_math_scores],
                                           '12th': [twelfth_grader_math_scores]})

math_scores_by_grade.index.name = None

math_scores_by_grade

,9th,10th,11th,12th
0,Student ID reading_s...,Student ID student_name gender gra...,Student ID reading_s...,Student ID reading_s...

In [80]:
# Use the code provided to separate the data by grade
ninth_graders = combo_df[(combo_df["grade"] == "9th")]
tenth_graders = combo_df[(combo_df["grade"] == "10th")]
eleventh_graders = combo_df[(combo_df["grade"] == "11th")]
twelfth_graders = combo_df[(combo_df["grade"] == "12th")]

# Group by `school_name` and take the mean of the `math_score` column for each.
ninth_grade_math_scores = ninth_graders.groupby(["school_name"]).mean(['math_score'])
tenth_grader_math_scores = tenth_graders.groupby(["school_name"]).mean(['math_score'])
eleventh_grader_math_scores = eleventh_graders.groupby(["school_name"]).mean(['math_score'])
twelfth_grader_math_scores = twelfth_graders.groupby(["school_name"]).mean(['math_score'])

# Combine each of the scores above into single DataFrame called `math_scores_by_grade`
math_scores_by_grade = pd.DataFrame({"school_name": ninth_grade_math_scores,
                                     "9th": ninth_grade_math_scores,
                                     "10th": tenth_grader_math_scores,
                                     "11th": eleventh_grader_math_scores,
                                     "12th": twelfth_grader_math_scores})

math_scores_by_grade.head()

ValueError: If using all scalar values, you must pass an index

In [81]:
avgm_per_grade = combo_df.groupby(['grade']) ['math_score'].mean()
avgm_per_grade

grade
10th    78.941483
11th    79.083548
12th    78.993164
9th     78.935659
Name: math_score, dtype: float64

In [82]:
avgr_per_grade = combo_df.groupby(['grade'])['reading_score'].mean()
avgr_per_grade

grade
10th    81.874410
11th    81.885714
12th    81.819851
9th     81.914358
Name: reading_score, dtype: float64

In [147]:
# Establish the bins
spending_bins = [0, 585, 630, 645, 680]
spending_labels = ["<$585", "$585-630", "$630-645", "$645-680"]

In [148]:
# Create a copy of the school summary since it has the "Per Student Budget"
school_spending_df = per_student_budget.copy()
school_spending_df

                       Per Capita
school_name
Bailey High School      3124928.0
Cabrera High School     1081356.0
Figueroa High School    1884411.0
Ford High School        1763916.0
Griffin High School      917500.0
Hernandez High School   3022020.0
Holden High School       248087.0
Huang High School       1910635.0
Johnson High School     3094650.0
Pena High School         585858.0
Rodriguez High School   2547363.0
Shelton High School     1056600.0
Thomas High School      1043130.0
Wilson High School      1319574.0
Wright High School      1049400.0

In [149]:
# Use `pd.cut` to categorize spending based on the bins.

pd.cut(school_spending_df["Per Capita"], spending_bins, labels=spending_labels)

school_name
Bailey High School       NaN
Cabrera High School      NaN
Figueroa High School     NaN
Ford High School         NaN
Griffin High School      NaN
Hernandez High School    NaN
Holden High School       NaN
Huang High School        NaN
Johnson High School      NaN
Pena High School         NaN
Rodriguez High School    NaN
Shelton High School      NaN
Thomas High School       NaN
Wilson High School       NaN
Wright High School       NaN
Name: Per Capita, dtype: category
Categories (4, object): ['<$585' < '$585-630' < '$630-645' < '$645-680']

In [150]:
school_spending_df["Spending Ranges (Per Student)"] = pd.cut(school_spending_df["Per Capita"], spending_bins, labels=spending_labels)
school_spending_df.head()

                      Per Capita Spending Ranges (Per Student)
school_name
Bailey High School     3124928.0                           NaN
Cabrera High School    1081356.0                           NaN
Figueroa High School   1884411.0                           NaN
Ford High School       1763916.0                           NaN
Griffin High School     917500.0                           NaN

In [ ]:
#  Calculate averages for the desired columns.
spending_math_scores = school_spending_df.groupby(["Spending Ranges (Per Student)"])["Average Math Score"].mean()
spending_reading_scores = school_spending_df.groupby(["Spending Ranges (Per Student)"])["Average Reading Score"].mean()
spending_passing_math = school_spending_df.groupby(["Spending Ranges (Per Student)"])["% Passing Math"].mean()
spending_passing_reading = school_spending_df.groupby(["Spending Ranges (Per Student)"])["% Passing Reading"].mean()
overall_passing_spending = school_spending_df.groupby(["Spending Ranges (Per Student)"])["% Overall Passing"].mean()

In [ ]:
# Assemble into DataFrame

concatenated_df = pd.concat([df1, df2])
spending_summary = pd.concat([[school_spending_df]: "Spending Ranges (Per Student)", []: "Average Math Score", []: "Average Reading Score", []: "% Passing Math", []: "% Passing Reading", []: "% Overall Passing"])

# Display results
spending_summary

In [153]:
# Establish the bins.
size_bins = [0, 1000, 2000, 5000]
size_labels = ["Small (<1000)", "Medium (1000-2000)", "Large (2000-5000)"]

In [ ]:
# Categorize the spending based on the bins
# Use `pd.cut` on the "Total Students" column of the `per_school_summary` DataFrame.

per_school_summary["School Size"] = pd.cut(per_school_summary["Total Students"], size_bins, labels=size_labels)
per_school_summary

In [ ]:
# Calculate averages for the desired columns.
size_math_scores = per_school_summary.groupby(["School Size"])["Average Math Score"].mean()
size_reading_scores = per_school_summary.groupby(["School Size"])["Average Reading Score"].mean()
size_passing_math = per_school_summary.groupby(["School Size"])["% Passing Math"].mean()
size_passing_reading = per_school_summary.groupby(["School Size"])["% Passing Reading"].mean()
size_overall_passing = per_school_summary.groupby(["School Size"])["% Overall Passing"].mean()

In [ ]:
# Create a DataFrame called `size_summary` that breaks down school performance based on school size (small, medium, or large).
# Use the scores above to create a new DataFrame called `size_summary`

size_summary = pd.concat([[school_spending_df]: "Spending Ranges (Per Student)", []: "Average Math Score", []: "Average Reading Score", []: "% Passing Math", []: "% Passing Reading", []: "% Overall Passing"])

# Group the per_school_summary DataFrame by "School Type" and average the results.
average_math_score_by_type = per_school_summary.groupby(["School Type"])["Average Math Score"].mean()
average_reading_score_by_type = per_school_summary.groupby(["School Type"])["Average Reading Score"].mean()
average_percent_passing_math_by_type = per_school_summary.groupby(["School Type"])["% Passing Math"].mean()
average_percent_passing_reading_by_type = per_school_summary.groupby(["School Type"])["% Passing Reading"].mean()
average_percent_overall_passing_by_type = per_school_summary.groupby(["School Type"])["% Overall Passing"].mean()

# Display results
size_summary

In [ ]:
# Assemble the new data by type into a DataFrame called `type_summary`
type_summary =

# Display results
type_summary